# DefDrpShadowEnabled

```pascal
FUNCTION DefDrpShadowEnabled : BOOLEAN;
```

```python
def vs.DefDrpShadowEnabled():
    return BOOLEAN
```

## Examples
```pascal
resultOK := DefDrpShadowEnabled;
```
```python
import vs

ok = vs.DefDrpShadowEnabled()
if ok:
    vs.Message('DefDrpShadowEnabled succeeded')
else:
    vs.Message('DefDrpShadowEnabled failed')
```

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes